rails_app/app/controllers/sessions_controller.rb

  def login
    user = User.find_by_username(params[:username])
---
SELECT "users".* FROM "users" WHERE "users"."username" = 'pixel' LIMIT 1

  def who
    if (session[:id])
      render text: User.find(session[:id]).username
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]