rails_app/app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "mail", "password", "updated_at", "username") VALUES (?, ?, ?, ?, ?)  [["created_at", Thu, 09 Jan 2014 07:37:30 UTC +00:00], ["mail", "m.r@gmail.com"], ["password", "asdasd"], ["updated_at", Thu, 09 Jan 2014 07:37:30 UTC +00:00], ["username", "pixel"]]
---
  def create
    user = User.create(user_params)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "users" SET "password" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["password", "qweqwe"], ["updated_at", Thu, 09 Jan 2014 08:39:12 UTC +00:00]]
---
  def change_password
    user = User.find(session[:id])
    if (user.password == params[:old])
      user.password = params[:new]
      if (user.save)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "users" SET "public_email" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["public_email", true], ["updated_at", Thu, 09 Jan 2014 10:08:56 UTC +00:00]]
---
  def edit
    change = false;
    user = User.find(session[:id])
    if (params[:name])
      user.name = params[:name]
      change = true;
    end
    if (params[:note])
      user.note = params[:note]
      change = true;
    end
    if (params[:public_email])
      user.public_email = params[:public_email]
      change = true;
    end
    if (change)
      if (user.save)

SELECT "users".* FROM "users" WHERE "users"."username" = 'pixel' LIMIT 1
---
  def show
    user = User.find_by_username(params[:username])

SELECT "users".* FROM "users" WHERE (public_email = true AND mail = 'm.r@gmail.com#')
SELECT "users".* FROM "users" WHERE (username LIKE '%d%') AND "users"."public_email" = 't'
---
  def find
    if (params[:username] || params[:name] || params[:mail])
      username = params[:username]
      name = params[:name]
      mail = params[:mail]
      if (username)
        users = User.where("username LIKE ?", "%#{username}%")
      end
      if (name)
        if (users)
          users = users.where("name LIKE ?", "%#{name}%")
        else
          users = User.where("name LIKE ?", "%#{name}%")
        end
      end
      if (mail)
        if (users)
          users = users.where({:public_email => true})