app/controllers/devices_controller.rb

INSERT INTO "devices" ("comment", "created_at", "identifier", "name", "password", "public", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "devices" SET "user_id" = ?, "updated_at" = ? WHERE "devices"."id" = 4  [["user_id", 1], ["updated_at", Sat, 25 Jan 2014 17:03:29 UTC +00:00]]
---
  def create
    device = Device.create(device_params)
    device.user = User.find(session[:id])
    if (device.save)

SELECT "devices".* FROM "devices" WHERE "devices"."user_id" = 1 AND "devices"."name" = 'mobil' LIMIT 1
UPDATE "devices" SET "comment" = ?, "public" = ?, "updated_at" = ? WHERE "devices"."id" = 3  [["comment", "Lorem ipsum"], ["public", true], ["updated_at", Fri, 21 Feb 2014 12:26:53 UTC +00:00]]
---
  def edit
    device = Device.find_by_user_id_and_name(session[:id], params[:name])
    if (device)
      change = false
      if (params[:new_name])
        device.name = params[:new_name]
        change = true
      end
      if (params[:comment])
        device.comment = params[:comment]
        change = true
      end
      if (params[:public])
        device.public = params[:public]
        change = true
      end
      if (change)
        if (device.save)

SELECT "devices".* FROM "devices"
---
  def full_index
    render json: Device.all

SELECT "users".* FROM "users" WHERE "users"."username" = 'pixel' LIMIT 1
SELECT "devices".* FROM "devices" WHERE "devices"."user_id" = 1
SELECT "devices".* FROM "devices" WHERE "devices"."user_id" = 2 AND "devices"."public" = 't'
SELECT "devices".* FROM "devices"
SELECT "users".* FROM "users"
---
  def index
    user = User.find_by_username(params[:username])
    if (user)
      remove_identifier = false
      if (user.id == session[:id])
        devices = Device.find_all_by_user_id(user.id)
      else
        devices = Device.find_all_by_user_id_and_public(user.id, true)
        remove_identifier = true;
      end
      response = []
      devices.each do |device|