app/controllers/feeds_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
INSERT INTO "feeds" ("created_at", "identifier", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sat, 11 Jan 2014 17:27:45 UTC +00:00], ["identifier", "iW2dFYF9qD1GxbxS7PJPoeI/69I="], ["name", "1feed"], ["updated_at", Sat, 11 Jan 2014 17:27:45 UTC +00:00]]
INSERT INTO "admins" ("created_at", "feed_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Sat, 11 Jan 2014 18:15:50 UTC +00:00], ["feed_id", 5], ["updated_at", Sat, 11 Jan 2014 18:15:50 UTC +00:00], ["user_id", 2]]
UPDATE "feeds" SET "identifier" = ?, "updated_at" = ? WHERE "feeds"."id" = 5  [["identifier", "rtY4Vru9xSv1fk+IhR0Csjnqy7I="], ["updated_at", Sat, 11 Jan 2014 18:15:50 UTC +00:00]]
---
  def create
    user = User.find(session[:id])
    feed = Feed.create(feed_params)
    admin = Admin.new
    admin.user = user
    feed.admins.push(admin)

SELECT "feeds".* FROM "feeds"
---
  def full_index
    render json: Feed.all

SELECT "feeds".* FROM "feeds" WHERE "feeds"."identifier" = 'rtY4Vru9xSv1fk+IhR0Csjnqy7I=' LIMIT 1
SELECT "admins".* FROM "admins" WHERE "admins"."feed_id" = ?  [["feed_id", 5]]
---
  def index_admins
    feed = Feed.find_by_identifier(params[:identifier])
    admins = feed.admins
    response = []
    admins.each do |admin|

SELECT "feeds".* FROM "feeds" WHERE "feeds"."identifier" = 'wO4gwNRcUtQNSiSLia26QrGtwjI=' LIMIT 1
---
  def index_users_writers
    feed = Feed.find_by_identifier(params[:identifier])

SELECT "feeds".* FROM "feeds" WHERE "feeds"."identifier" = 'wO4gwNRcUtQNSiSLia26QrGtwjI=' LIMIT 1
---
  def index_users_readers
    feed = Feed.find_by_identifier(params[:identifier])

SELECT "feeds".* FROM "feeds" WHERE "feeds"."identifier" = 'wO4gwNRcUtQNSiSLia26QrGtwjI=' LIMIT 1
---
  def index_writing_devices
    feed = Feed.find_by_identifier(params[:identifier])

SELECT "feeds".* FROM "feeds" WHERE "feeds"."identifier" = 'wO4gwNRcUtQNSiSLia26QrGtwjI=' LIMIT 1
---
  def index_reading_devices
    feed = Feed.find_by_identifier(params[:identifier])

SELECT "users".* FROM "users" WHERE "users"."username" = 'pixel' LIMIT 1
SELECT "feeds".* FROM "feeds" WHERE "feeds"."identifier" = 'rtY4Vru9xSv1fk+IhR0Csjnqy7I=' LIMIT 1
SELECT "admins".* FROM "admins" WHERE "admins"."user_id" = 1 AND "admins"."feed_id" = 5 LIMIT 1
UPDATE "feeds" SET "identifier" = ?, "updated_at" = ? WHERE "feeds"."id" = 5  [["identifier", "kIOoAMHDeZ8rlIXFxMXaurTih8Q="], ["updated_at", Sat, 11 Jan 2014 18:36:43 UTC +00:00]]
---
  def add_admin
    user = User.find_by_username(params[:username])
    feed = Feed.find_by_identifier(params[:identifier])
    admin = Admin.find_by_user_id_and_feed_id(user.id, feed.id)
    if admin
      error_duplicity([user.username + " is already admin"])
    else
      admin = Admin.new
      admin.user = user
      feed.admins.push(admin)

SELECT "users".* FROM "users" WHERE "users"."username" = 'pixel' LIMIT 1
SELECT "feeds".* FROM "feeds" WHERE "feeds"."identifier" = 'kIOoAMHDeZ8rlIXFxMXaurTih8Q=' LIMIT 1
SELECT "admins".* FROM "admins" WHERE "admins"."feed_id" = ?  [["feed_id", 5]]
SELECT "admins".* FROM "admins" WHERE "admins"."user_id" = 1 AND "admins"."feed_id" = 5 LIMIT 1
DELETE FROM "admins" WHERE "admins"."id" = 2
UPDATE "admins" SET "feed_id" = NULL WHERE "admins"."feed_id" = ? AND "admins"."id" IN (2)  [["feed_id", 5]]
UPDATE "feeds" SET "identifier" = ?, "updated_at" = ? WHERE "feeds"."id" = 5  [["identifier", "wO4gwNRcUtQNSiSLia26QrGtwjI="], ["updated_at", Sat, 11 Jan 2014 19:17:56 UTC +00:00]]
---
  def remove_admin
    user = User.find_by_username(params[:username])
    feed = Feed.find_by_identifier(params[:identifier])
    if feed.admins.length < 2
      error_denied(["At least one admin must be always present"])
    else
      admin = Admin.find_by_user_id_and_feed_id(user.id, feed.id)
      if admin
        feed.admins.delete(admin)
        admin.delete
        feed.save

SELECT "users".* FROM "users" WHERE "users"."username" = '1feed' LIMIT 1
SELECT "feeds".* FROM "feeds" WHERE "feeds"."identifier" = 'wO4gwNRcUtQNSiSLia26QrGtwjI=' LIMIT 1
SELECT "writers".* FROM "writers" WHERE "writers"."user_id" = 1 AND "writers"."feed_id" = 5 LIMIT 1
---
  def add_user_write
    user = User.find_by_username(params[:username])
    feed = Feed.find_by_identifier(params[:identifier])
    writer = Writer.find_by_user_id_and_feed_id(user.id, feed.id)

SELECT "users".* FROM "users" WHERE "users"."username" = 'pixel' LIMIT 1
SELECT "feeds".* FROM "feeds" WHERE "feeds"."identifier" = 'wO4gwNRcUtQNSiSLia26QrGtwjI=' LIMIT 1
SELECT "writers".* FROM "writers" WHERE "writers"."user_id" = 1 AND "writers"."feed_id" = 5 LIMIT 1
DELETE FROM "writers" WHERE "writers"."id" = 1
UPDATE "writers" SET "feed_id" = NULL WHERE "writers"."feed_id" = ? AND "writers"."id" IN (1)  [["feed_id", 5]]
---
  def remove_user_write
    user = User.find_by_username(params[:username])
    feed = Feed.find_by_identifier(params[:identifier])
    writer = Writer.find_by_user_id_and_feed_id(user.id, feed.id)
    if writer
      feed.writers.delete(writer)
      writer.delete
      feed.save

SELECT "users".* FROM "users" WHERE "users"."username" = 'pixel' LIMIT 1
SELECT "feeds".* FROM "feeds" WHERE "feeds"."identifier" = 'wO4gwNRcUtQNSiSLia26QrGtwjI=' LIMIT 1
SELECT "readers".* FROM "readers" WHERE "readers"."user_id" = 1 AND "readers"."feed_id" = 5 LIMIT 1
---
  def add_user_read
    user = User.find_by_username(params[:username])
    feed = Feed.find_by_identifier(params[:identifier])
    reader = Reader.find_by_user_id_and_feed_id(user.id, feed.id)

SELECT "users".* FROM "users" WHERE "users"."username" = 'treti' LIMIT 1
SELECT "feeds".* FROM "feeds" WHERE "feeds"."identifier" = 'wO4gwNRcUtQNSiSLia26QrGtwjI=' LIMIT 1
SELECT "readers".* FROM "readers" WHERE "readers"."user_id" = 3 AND "readers"."feed_id" = 1 LIMIT 1
DELETE FROM "readers" WHERE "readers"."id" = 1
UPDATE "readers" SET "feed_id" = NULL WHERE "readers"."feed_id" = ? AND "readers"."id" IN (1)  [["feed_id", 1]]
---
  def remove_user_read
    user = User.find_by_username(params[:username])
    feed = Feed.find_by_identifier(params[:identifier])
    reader = Reader.find_by_user_id_and_feed_id(user.id, feed.id)
    if reader
      feed.readers.delete(reader)
      reader.delete
      feed.save

SELECT "users".* FROM "users" WHERE "users"."username" = 'pixel' LIMIT 1
SELECT "devices".* FROM "devices" WHERE "devices"."user_id" = 1 AND "devices"."name" = 'testovacie zariadenie' LIMIT 1
SELECT "feeds".* FROM "feeds" WHERE "feeds"."identifier" = 'wO4gwNRcUtQNSiSLia26QrGtwjI=' LIMIT 1
SELECT "writing_devices".* FROM "writing_devices" WHERE "writing_devices"."device_id" = 2 AND "writing_devices"."feed_id" = 1 LIMIT 1
---
  def add_writing_device
    user = User.find_by_username(params[:username])
    device = Device.find_by_user_id_and_name(user.id, params[:device_name])
    feed = Feed.find_by_identifier(params[:identifier])
    writer = WritingDevice.find_by_device_id_and_feed_id(device.id, feed.id)

SELECT "users".* FROM "users" WHERE "users"."username" = 'pixel' LIMIT 1
SELECT "devices".* FROM "devices" WHERE "devices"."user_id" = 1 AND "devices"."name" = 'testovacieasdasd' LIMIT 1
SELECT "feeds".* FROM "feeds" WHERE "feeds"."identifier" = 'wO4gwNRcUtQNSiSLia26QrGtwjI=' LIMIT 1
SELECT "writing_devices".* FROM "writing_devices" WHERE "writing_devices"."device_id" = 3 AND "writing_devices"."feed_id" = 1 LIMIT 1
DELETE FROM "writing_devices" WHERE "writing_devices"."id" = 2
UPDATE "writing_devices" SET "feed_id" = NULL WHERE "writing_devices"."feed_id" = ? AND "writing_devices"."id" IN (2)  [["feed_id", 1]]
---
  def remove_writing_device
    user = User.find_by_username(params[:username])
    device = Device.find_by_user_id_and_name(user.id, params[:device_name])
    feed = Feed.find_by_identifier(params[:identifier])
    writer = WritingDevice.find_by_device_id_and_feed_id(device.id, feed.id)
    if writer
      feed.writing_devices.delete(writer)
      writer.delete
      feed.save

SELECT "users".* FROM "users" WHERE "users"."username" = 'pixel' LIMIT 1
SELECT "devices".* FROM "devices" WHERE "devices"."user_id" = 1 AND "devices"."name" = 'testovacie zariadenie' LIMIT 1
SELECT "feeds".* FROM "feeds" WHERE "feeds"."identifier" = 'wO4gwNRcUtQNSiSLia26QrGtwjI=' LIMIT 1
SELECT "reading_devices".* FROM "reading_devices" WHERE "reading_devices"."device_id" = 2 AND "reading_devices"."feed_id" = 1 LIMIT 1
---
  def add_reading_device
    user = User.find_by_username(params[:username])
    device = Device.find_by_user_id_and_name(user.id, params[:device_name])
    feed = Feed.find_by_identifier(params[:identifier])
    reader = ReadingDevice.find_by_device_id_and_feed_id(device.id, feed.id)

SELECT "users".* FROM "users" WHERE "users"."username" = 'pixel' LIMIT 1
SELECT "devices".* FROM "devices" WHERE "devices"."user_id" = 1 AND "devices"."name" = 'testovacie' LIMIT 1
SELECT "feeds".* FROM "feeds" WHERE "feeds"."identifier" = 'wO4gwNRcUtQNSiSLia26QrGtwjI=' LIMIT 1
SELECT "reading_devices".* FROM "reading_devices" WHERE "reading_devices"."device_id" = 3 AND "reading_devices"."feed_id" = 1 LIMIT 1
DELETE FROM "reading_devices" WHERE "reading_devices"."id" = 2
UPDATE "reading_devices" SET "feed_id" = NULL WHERE "reading_devices"."feed_id" = ? AND "reading_devices"."id" IN (2)  [["feed_id", 1]]
---
  def remove_reading_device
    user = User.find_by_username(params[:username])
    device = Device.find_by_user_id_and_name(user.id, params[:device_name])
    feed = Feed.find_by_identifier(params[:identifier])
    reader = ReadingDevice.find_by_device_id_and_feed_id(device.id, feed.id)
    if reader
      feed.reading_devices.delete(reader)
      reader.delete
      feed.save