app/controllers/messages_controller.rb

  def full_index
    render json: Message.all
---
SELECT "messages".* FROM "messages"

  def insert
    message = Message.new(message_params)
    message.user = @user
    message.device = @device
    if session[:type] == 'user'
      message.read_by_user = true;
    end
    if session[:type] == 'device'
      message.read_by_device = true;
    end
    if message.save
---
INSERT INTO "messages" ("created_at", "device_id", "message", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Thu, 27 Feb 2014 14:50:03 UTC +00:00], ["device_id", 1], ["message", "turn off"], ["updated_at", Thu, 27 Feb 2014 14:50:03 UTC +00:00], ["user_id", 2]]