app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = 'pixel' LIMIT 1
---
  def login
    user = User.find_by_username(params[:username])

SELECT "devices".* FROM "devices" WHERE "devices"."identifier" = '0123456789' LIMIT 1
---
  def device_login
    device = Device.find_by_identifier(params[:identifier])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "devices".* FROM "devices" WHERE "devices"."id" = ? LIMIT 1  [["id", 1]]
---
  def who
    if (session[:id])
      if (session[:type] == 'user')
        render text: 'user ' + User.find(session[:id]).username
      end
      if (session[:type] == 'device')
        render text: 'device ' + Device.find(session[:id]).name