app/controllers/shared_data_controller.rb

  def full_index
    data = SharedData.all
---
SELECT "shared_data".* FROM "shared_data"

  def insert
    find_device
    unless @device
      error_missing_entry(["Device with identifier #{params[:deviceIdentifier]} can't be found"])
      return
    end
    @errors = []
    @not_written_feed_names = []
    get_writable_ids
    data = []
    tracks = []
    saved = false
    entries = params['entries']
    if entries
      entries.each do |entry|
        feed_ids = entry['feedIdentifiers']
        savable_feeds = get_savable_feeds(feed_ids)
        if savable_feeds.length > 0
          json_data = entry['jsonData']
          share_data = SharedData.new
          share_data.device_id = @device.id
          share_data.json_data = json_data
          savable_feeds.each do |feed|
            share_data.feeds.push(feed)
          end
          track = Track.find_by_identifier(entry['trackIdentifier'])
          if track
            if track.user_id == @device.user_id
              share_data.tracks.push(track)
              track.shared_datas.push(share_data)
---
INSERT INTO "feeds_shared_data" ("shared_data_id", "feed_id") VALUES (1, 1)
INSERT INTO "shared_data" ("created_at", "device_id", "json_data", "time_stamp", "track_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
UPDATE "devices" SET "current_track" = ?, "updated_at" = ? WHERE "devices"."id" = 1  [["current_track", 1], ["updated_at", Sat, 22 Feb 2014 12:13:18 UTC +00:00]]

  def find_device
    @device = Device.find_by_identifier(params[:deviceIdentifier])
---
SELECT "devices".* FROM "devices" WHERE "devices"."identifier" = 'identifier' LIMIT 1