app/controllers/shared_data_controller.rb

SELECT "feeds".* FROM "feeds" WHERE "feeds"."identifier" = 'wO4gwNRcUtQNSiSLia26QrGtwjI=' LIMIT 1
---
  def insert
    find_device
    unless @device
      error_missing_entry(["Device with identifier #{params[:deviceIdentifier]} can't be found"])
      return
    end
    get_writable_ids
    unless @writable_feeds.length > 0
      error_denied(['No feeds can be written'])
      return
    end
    begin
      if @device.device_requests.find(params[:requestIdentifier])
        response_ok
        return
      end
    rescue ActiveRecord::RecordNotFound
    end
    @errors = []
    save_data = []
    time_stamp = params[:timeStamp]
    entries = params[:entries]
    device_id = @device.id
    entries.each do |entry|
      feeds_identifiers = entry['feedsIdentifiers']
      writable_feeds = []
      feeds_identifiers.each do |feed_id|
        feed = Feed.find_by_identifier(feed_id)