app/controllers/users_controller.rb

  def create
    user = User.create(user_params)
---
INSERT INTO "users" ("created_at", "mail", "password", "updated_at", "username") VALUES (?, ?, ?, ?, ?)  [["created_at", Thu, 09 Jan 2014 07:37:30 UTC +00:00], ["mail", "m.r@gmail.com"], ["password", "asdasd"], ["updated_at", Thu, 09 Jan 2014 07:37:30 UTC +00:00], ["username", "pixel"]]

  def change_password
    user = User.find(session[:id])
    if (user.password == params[:old])
      user.password = params[:new]
      if (user.save)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "users" SET "password" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["password", "qweqwe"], ["updated_at", Thu, 09 Jan 2014 08:39:12 UTC +00:00]]

  def edit
    change = false;
    user = User.find(session[:id])
    if (params[:name])
      user.name = params[:name]
      change = true;
    end
    if (params[:comment])
      user.comment = params[:comment]
      change = true;
    end
    if (params[:public_email])
      user.public_email = params[:public_email]
      change = true;
    end
    if (change)
      if (user.save)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "users" SET "name" = ?, "comment" = ?, "public_email" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["name", "Michal Raška"], ["comment", "admin"], ["public_email", true], ["updated_at", Wed, 12 Feb 2014 15:27:32 UTC +00:00]]

  def show
    user = User.find_by_username(params[:username])
---
SELECT "users".* FROM "users" WHERE "users"."username" = 'pixel' LIMIT 1

  def find
    if (params[:username] || params[:name] || params[:mail])
      username = params[:username]
      name = params[:name]
      if (username)
        users = User.where("username LIKE ?", "%#{username}%")
---
SELECT "users".* FROM "users" WHERE (public_email = true AND mail = 'm.r@gmail.com#')

  def index_feeds_where_admin
    user = User.find_by_username(params[:username])
    if user
      admins = Admin.find_all_by_user_id(user.id)
---
SELECT "users".* FROM "users" WHERE "users"."username" = 'pixel' LIMIT 1
SELECT "admins".* FROM "admins" WHERE "admins"."user_id" = 1

  def index_feeds_where_reader
    user = User.find_by_username(params[:username])
    if user
      readers = Reader.find_all_by_user_id(user.id)
---
SELECT "users".* FROM "users" WHERE "users"."username" = 'pixel' LIMIT 1
SELECT "readers".* FROM "readers" WHERE "readers"."user_id" = 1